[
  {
    "title": "Summary",
    "description": "A superficial analysis of signal processing.",
    "image_name": "preprocess.png"
  },
  {
    "title": "R-Peaks",
    "description": "R-peaks in ECG data represent the points of maximum upward deflection in the QRS complex of the electrocardiogram. These peaks correspond to the depolarization of the heart's ventricles, which is the most prominent feature in an ECG signal. Detecting R-peaks is crucial for analyzing heart rate, identifying arrhythmias, and other cardiac conditions.",
    "image_name": "rpeaks.png"
  },
  {
    "title": "T-P-Q-S Peaks",
    "description": "In an ECG (Electrocardiogram), different peaks (T-P-Q-S | 0-1-2-3)correspond to specific electrical activities of the heart:\n\nP-Peak:\n\nWhat it Represents: The P wave represents the depolarization (electrical activation) of the atria, the upper chambers of the heart. This is when the atria contract and push blood into the ventricles.\nPosition: The P wave is the first small upward deflection in the ECG cycle.\nQ-Peak:\n\nWhat it Represents: The Q wave is the first negative deflection after the P wave, representing the initial phase of ventricular depolarization. It's part of the QRS complex.\nPosition: The Q wave is a small downward deflection preceding the R peak.\nR-Peak:\n\nWhat it Represents: The R wave is the most significant upward deflection in the QRS complex, representing the main phase of ventricular depolarization. This is the moment the ventricles contract to pump blood out of the heart.\nPosition: The R peak is the tallest point in the ECG waveform.\nS-Peak:\n\nWhat it Represents: The S wave follows the R wave and is a downward deflection. It represents the final phase of ventricular depolarization.\nPosition: The S wave comes immediately after the R peak, completing the QRS complex.\nT-Peak:\n\nWhat it Represents: The T wave represents the repolarization (recovery) of the ventricles after they have contracted. It indicates the heart is preparing for the next cycle.\nPosition: The T wave is a modest upward deflection following the QRS complex.\nThese peaks are crucial for interpreting the ECG, as they provide insights into the timing and coordination of the heart's electrical activity, which is vital for diagnosing various cardiac conditions.",
    "image_name": "tpqspeaks.png"
  },
{
    "title": "Delineating P-Q-S-T Peaks",
    "description": "Delineating the PQST signal in an ECG involves identifying and marking the specific points corresponding to the P wave, QRS complex (which includes Q, R, and S waves), and T wave within the ECG signal. This process is essential for detailed analysis of heart function and diagnosing various cardiac conditions. Here's what it involves:\n\nSteps for Delineation:\n\n1. Preprocessing:\n   - Filtering: The ECG signal is filtered to remove noise, baseline drift, and other artifacts that can obscure the PQST features.\n\n2. R-Peak Detection:\n   - Finding R-Peaks: R-peaks are the easiest to detect due to their prominent upward deflection in the QRS complex. This step usually comes first as it serves as a reference point for identifying the other components.\n\n3. QRS Complex Delineation:\n   - Identifying Q and S Peaks: Once the R-peak is identified, the Q and S peaks are delineated by looking for the first downward deflection before the R-peak (Q wave) and the first downward deflection after the R-peak (S wave).\n\n4. P Wave Delineation:\n   - Locating P Wave: The P wave occurs before the QRS complex. It is identified as a small upward deflection preceding the QRS complex. It often requires examining the segment before the Q wave.\n\n5. T Wave Delineation:\n   - Locating T Wave: The T wave follows the QRS complex and is typically a larger, rounded wave. It is associated with ventricular repolarization.\n\n6. Validation:\n   - Checking for Abnormalities: After delineating the PQST waves, the identified points are validated by checking their sequence, duration, and amplitude against standard ECG characteristics.\n\nWhy Delineation is Important:\n- Heart Rate Calculation: Accurate delineation of the R peaks helps in calculating the heart rate.\n- Diagnostic Insights: Delineation helps in identifying arrhythmias, ischemia, or other cardiac abnormalities.\n- Feature Extraction: For advanced analysis or machine learning, extracting precise features like PQ, QT intervals, or ST segments is crucial.\n\nIn summary, delineating the PQST signal is about accurately identifying and marking the start, peak, and end of each significant wave in the ECG, which is critical for understanding the heart's electrical activity.",
    "image_name": "delineatepqstpeaks.png"
},
  {
    "title": "Onsets-Offsets-Peaks",
    "description": "In an ECG, the onsets, offsets, and peaks of the PQRST waves are key points that mark the beginning, end, and maximum amplitude of each wave. These points are crucial for detailed analysis of the heart’s electrical activity. Here’s what each term refers to:\n\n1. P Wave:\n   - Onset: The point where the P wave begins to rise from the baseline, indicating the start of atrial depolarization.\n   - Peak: The highest point of the P wave, representing the maximal depolarization of the atria.\n   - Offset: The point where the P wave returns to the baseline, indicating the end of atrial depolarization.\n\n2. QRS Complex:\n   - Q Wave:\n     - Onset: The start of the Q wave, where the waveform begins to deflect downward from the baseline. It marks the beginning of ventricular depolarization.\n     - Peak: The lowest point of the Q wave (if present).\n     - Offset: The point where the Q wave ends, transitioning into the R wave.\n   - R Wave:\n     - Onset: The start of the R wave, where the waveform begins to rise sharply upward.\n     - Peak: The highest point of the R wave, representing the maximal depolarization of the ventricles.\n     - Offset: The point where the R wave starts to decline, transitioning into the S wave.\n   - S Wave:\n     - Onset: The start of the S wave, where the waveform begins to deflect downward after the R wave.\n     - Peak: The lowest point of the S wave.\n     - Offset: The point where the S wave returns to the baseline, indicating the end of ventricular depolarization.\n\n3. T Wave:\n   - Onset: The point where the T wave begins to rise from the baseline, indicating the start of ventricular repolarization.\n   - Peak: The highest point of the T wave, representing the maximal repolarization of the ventricles.\n   - Offset: The point where the T wave returns to the baseline, marking the end of ventricular repolarization.\n\nImportance of These Points:\n- Onsets and Offsets: These points are used to measure intervals like the PR interval, QT interval, and ST segment, which are critical for diagnosing conditions such as heart block, ischemia, and long QT syndrome.\n- Peaks: Peaks represent the maximum electrical activity during each phase of the cardiac cycle and are used for calculating amplitudes and understanding the strength of each wave.\n\nAccurate detection of onsets, offsets, and peaks in an ECG signal is essential for proper cardiac assessment and diagnosis.",
    "image_name": "onsetofset.png"
  },
  {
    "title": "Analyse EDR",
    "description": "Analyzing the Electrodermal Response (EDR), also known as Galvanic Skin Response (GSR), involves measuring the electrical conductance of the skin, which varies with its moisture level. This physiological response is linked to the activity of the sweat glands, which are controlled by the sympathetic nervous system. EDR is commonly used in psychophysiological research, stress detection, emotion analysis, and lie detection.",
    "image_name": "ecgrsp.png"
  },
  {
    "title": "Skin conductance response (SCR)",
    "description": "Skin conductance response (SCR), also known as the electrodermal response or galvanic skin response, is a measurement of how well the skin conducts electricity when it's exposed to arousing stimuli. SCR is an indirect way to measure the activity of the sympathetic autonomic nervous system, which is linked to emotion and attention. When the sympathetic nervous system is activated, sweat is produced, which increases the skin's conductivity.",
    "image_name": "scr2.png"
  }
]
